# Data Selection & Filtering
Selecting the right rows and columns is the first step in analyzing any dataset. Pandas gives you several powerful ways to do this.

Selecting Rows & ColumnS

In [2]:
import pandas as pd
import openpyxl

In [3]:
conda install openpyxl

Channels:
 - defaults
Platform: win-64
Collecting package metadata (repodata.json): ...working... done
Solving environment: ...working... done

# All requested packages already installed.


Note: you may need to restart the kernel to use updated packages.

In [4]:


df = pd.read_excel(
    r"C:\Users\Anshika\OneDrive\Desktop\Data-Science-Journey-2026\data2.xlsx",
    engine="openpyxl"
)

df.head()

          Actor Name  Age Country        Famous Movie         Awards
0  Leonardo DiCaprio   49     USA           Inception          Oscar
1  Robert Downey Jr.   59     USA            Iron Man  Oscar Nominee
2     Shah Rukh Khan   58   India             Pathaan       Filmfare
3        Emma Watson   34      UK        Harry Potter      MTV Award
4         Tom Cruise   62     USA  Mission Impossible   Golden Globe

In [9]:
df ['Actor Name']

0    Leonardo DiCaprio
1    Robert Downey Jr.
2       Shah Rukh Khan
3          Emma Watson
4           Tom Cruise
Name: Actor Name, dtype: object

In [11]:
df ['Actor Name'][2]

'Shah Rukh Khan'

In [13]:
type(df ['Actor Name'])

pandas.core.series.Series

 its a copy only ,it doesn't change the original dataframe

In [19]:
df [['Actor Name','Awards']]

          Actor Name         Awards
0  Leonardo DiCaprio          Oscar
1  Robert Downey Jr.  Oscar Nominee
2     Shah Rukh Khan       Filmfare
3        Emma Watson      MTV Award
4         Tom Cruise   Golden Globe

In [22]:
df

          Actor Name  Age Country        Famous Movie         Awards
0  Leonardo DiCaprio   49     USA           Inception          Oscar
1  Robert Downey Jr.   59     USA            Iron Man  Oscar Nominee
2     Shah Rukh Khan   58   India             Pathaan       Filmfare
3        Emma Watson   34      UK        Harry Potter      MTV Award
4         Tom Cruise   62     USA  Mission Impossible   Golden Globe

electing Rows by Index
Use .loc[] (label-based) and .iloc[] (position-based):

In [24]:
df.loc[1]#we uses the name of the location but in iloc we use the number

Actor Name      Robert Downey Jr.
Age                            59
Country                       USA
Famous Movie             Iron Man
Awards              Oscar Nominee
Name: 1, dtype: object

In [31]:
df.loc[4,'Awards']

'Golden Globe'

In [33]:
df.iloc[4,2]# 2 stands for country

'USA'

In [35]:
df.loc[0:2,['Awards','Age']]# it include the 2

          Awards  Age
0          Oscar   49
1  Oscar Nominee   59
2       Filmfare   58

In [43]:
df.iloc[0:2 , 0:1]# it exclude the 2

          Actor Name
0  Leonardo DiCaprio
1  Robert Downey Jr.

# Fast Access: .at and .iat
These are optimized for single element access:

In [46]:
df.at[0,'Actor Name']# only for accessing a perticular element

'Leonardo DiCaprio'

In [48]:
df.iat[0,0]

'Leonardo DiCaprio'

# Filtering with Conditions

In [58]:
df[df['Age']>55]['Actor Name']

1    Robert Downey Jr.
2       Shah Rukh Khan
4           Tom Cruise
Name: Actor Name, dtype: object

In [68]:
df[(df['Age']>55) & (['Country'])]

          Actor Name  Age Country        Famous Movie         Awards
1  Robert Downey Jr.   59     USA            Iron Man  Oscar Nominee
2     Shah Rukh Khan   58   India             Pathaan       Filmfare
4         Tom Cruise   62     USA  Mission Impossible   Golden Globe

# Querying with .query()

The .query() method in pandas lets you filter DataFrame rows using a string expression — it's a more readable and often more concise alternative to using boolean indexing.

#### 1. Column names become variables

In [77]:
df.query("Age >55 and Awards == 'Filmfare'")

       Actor Name  Age Country Famous Movie    Awards
2  Shah Rukh Khan   58   India      Pathaan  Filmfare

#### 2. String values must be in quotes
Use single or double quotes around strings in the expression:

In [79]:
df.query("Awards == 'Filmfare'")

       Actor Name  Age Country Famous Movie    Awards
2  Shah Rukh Khan   58   India      Pathaan  Filmfare

#### 3. Use backticks for column names with spaces or special characters
If a column name has spaces, use backticks (`):

In [95]:
df.query("`Actor Name`=='Shah Rukh Khan'")

       Actor Name  Age Country Famous Movie    Awards
2  Shah Rukh Khan   58   India      Pathaan  Filmfare

#### 4. You can use @ to reference Python variables
To pass external variables into .query():

In [97]:
age_limit =55
df.query("Age>@age_limit")

          Actor Name  Age Country        Famous Movie         Awards
1  Robert Downey Jr.   59     USA            Iron Man  Oscar Nominee
2     Shah Rukh Khan   58   India             Pathaan       Filmfare
4         Tom Cruise   62     USA  Mission Impossible   Golden Globe

#### 5. Logical operators
Use these:

and, or, not — instead of &, |, ~
==, !=, <, >, <=, >=

In [99]:
df.query("Age > 60 and Country =='USA' ")

   Actor Name  Age Country        Famous Movie        Awards
4  Tom Cruise   62     USA  Mission Impossible  Golden Globe

#### 6. Chained comparisons

In [101]:
df.query("45 <Age<=60 ")

          Actor Name  Age Country Famous Movie         Awards
0  Leonardo DiCaprio   49     USA    Inception          Oscar
1  Robert Downey Jr.   59     USA     Iron Man  Oscar Nominee
2     Shah Rukh Khan   58   India      Pathaan       Filmfare

#### 7. Avoid using reserved keywords as column names
If you have a column named class, lambda, etc., you’ll need to use backticks:

In [ ]:
# df.query("`class`==`physics`")  ------>  data is not there ,its just for understanding

#### 8. Case-sensitive
Column names and string values are case-sensitive:

In [ ]:
# df.query("country=='USA'")------> we need exact same name (c should be capital)

#### 9. .query() returns a copy, not a view
The result is a new DataFrame. Changes won't affect the original unless reassigned:

In [109]:
filtered = df.query("Age>60")
filtered

   Actor Name  Age Country        Famous Movie        Awards
4  Tom Cruise   62     USA  Mission Impossible  Golden Globe

#### Summary
Use df[col], .loc[], .iloc[], .at[], .iat[] to access data
Filter with logical conditions or .query() for readable code
Mastering selection makes the rest of pandas feel easy

In [145]:
df2 = df[['Age','Country']].copy() # often use .copy whenever you want to work with copy
df2

   Age Country
0   49     USA
1   59     USA
2   58   India
3   34      UK
4   62     USA

In [149]:
df2.loc[0,'Country'] = "pak"

In [151]:
df2

   Age Country
0   49     pak
1   59     USA
2   58   India
3   34      UK
4   62     USA

In [153]:
df

          Actor Name  Age Country        Famous Movie         Awards
0  Leonardo DiCaprio   49     USA           Inception          Oscar
1  Robert Downey Jr.   59     USA            Iron Man  Oscar Nominee
2     Shah Rukh Khan   58   India             Pathaan       Filmfare
3        Emma Watson   34      UK        Harry Potter      MTV Award
4         Tom Cruise   62     USA  Mission Impossible   Golden Globe